Repository: DariusFeher/Bidder
Catalog: bidnbuy/locale/*/LC_MESSAGES/django.po
Languages: ro

source: Hi,
ro: Salut,

source: Please use the link below to verify your account.
ro: Va rugam sa folositi link-ul de mai jos pentru a verficarea contului dumneavoastra

source: Kind Regards,
ro: O zi frumoasa,

source: Bidder Team
ro: Echipa Bidder

source: Login
ro: Intra in cont

source: %(link_begin)s Email not received? Check spam or Request a new activation link %(link_end)s
ro: %(link_begin)s Nu ati primit email-ul? Verificati folder-ul Spam sau Cereti un nou link de activare %(link_end)s

source: LOGIN
ro: AUTENTIFICARE

source: or
ro: sau

source: Login with Google
ro: Conectati-va cu Google

source: Don't have an account?
ro: Nu aveti un cont?

source: Sign Up
ro: Creeaza un cont

source: Forgot password?
ro: Ati uitat parola?

source: Reset password
ro: Resetati parola

source: Hi
ro: Salut,

source: You are receiving this email because you requested a password reset for your user account,
ro: Ati primit acest email deoarece ati solicitat resetarea parolei pentru contul dumneavoastra de utilizator,

source: Please go to the following page and choose a new password:
ro: Va rugam sa accesati urmatoarea pagina si alegeti o noua parola:

source: Register
ro: Inregistrare

source: Register Account
ro: Inregistrare

source: REGISTER
ro: Inregistreaza-te

source: Sign up with Google
ro: Inregistrati-va cu Google

source: Already have an account?
ro: Aveti deja un cont?

source: New activation link
ro: Cere un nou link de activare

source: Enter your email address below and we'll email you a new activation link.
ro: Introduceti email-ul dumneavoastra si va vom trimite un nou link de activare.

source: Submit
ro: Trimite

source: Reset password
ro: Resetati parola

source: Please enter your new password twice so we can verify you typed it in correctly.
ro: Va rugam sa introduceti noua parola de doua ori pentru a putea verifica daca ati introdus-o corect.

source: Change my password
ro: Reseteaza parola

source: Password reset
ro: Resetare parola

source: Forgotten password? Enter your email address below and we'll email instructions for setting a new one.
ro: Ati uitat parola? Introduceti adresa de email asociata contului dumneavoastra si va vom trimite instructiuni pentru resetarea parolei.

source: Reset my password
ro: Resetati parola

source: You are currently the highest bidder for
ro: In prezent oferta dvs este cea mai mare pentru

source: We will email you in case someone outbids you.
ro: Va vom anunta in cazul in care cineva apare o oferta mai mare decat a dvs.

source: Your bid
ro: Oferta dvs

source: EUR (€)
ro: EURO (€)

source: GBP (£)
ro: LIRE (£)

source: Ends in
ro: Se termina in

source: Who else is interested?
ro: Cine mai este interesat?

source: bidder(s)
ro: licitant(i)

source: bid(s)
ro: oferte

source: Check the product
ro: Verificati produsul

source: The bidding for
ro: Oferta pentru

source: has finished!
ro: s-a terminat!

source: Contact the winner to arrange the shipping of the product.
ro: Contactati castigatorul pentru a aranja livrarea produsului.

source: Winner Information
ro: Afla mai multe informatii despre produs

source: Last bid
ro: Ultima licitatie

source: Ends in: Auction finished!
ro: Se termina in: Licitatie finalizata!

source: Who else was interested?
ro: Cine mai este interesat?

source: See the product
ro: Adauga un anunt nou

source: Unfortunately there was no bidder for your product.
ro: Din pAcate, nu a existat niciun ofertant pentru produsul dvs.

source: Who was interested?
ro: Cine a fost interesat?

source: bidders
ro: licitanti

source: bids
ro: oferte

source: Have a look at our products
ro: Arunca o privire la produsele noastre

source: here.
ro: aici.

source: has finished and you won the bidding!
ro: s-a terminat si dvs sunteti castigatorul licitatiei!

source: Contact the seller to arrange the shipping of the product.
ro: Contactati vanzatorul pentru a aranja livrarea produsului.

source: Seller Information
ro: Informatiile vanzatorului

source: You have been outbid for
ro: Cineva a licitat mai mult decat dvs pentru

source: You need to raise your bid in order to get the product.
ro: Trebuie sa va mariti oferta pentru a obtine produsul.

source: Check the product and bid now
ro: Verificati produsul si licitati acum

source: Advanced Search
ro: Cautare Avansata

source: End date
ro: Data incheierii

source: March
ro: Martie

source: Search
ro: Cauta

source: Close
ro: Inchide

source: Search products
ro: Adauga un anunt nou

source: Reset filters
ro: Resetati filtrele

source: Find out more information
ro: Afla mai multe informatii despre produs

source: Add to favourites
ro: Adauga la favorite

source: Auction ends on
ro: Licitatia se incheie pe

source: Last bid:
ro: Ultima licitatie:

source: BID NOW
ro: LICITEAZA ACUM

source: Remove from favourites
ro: Eliminati din favorite

source: Product
ro: Anunt nou

source: added to favourites
ro: adaugat la favorite

source: Something went wrong...
ro: Ceva nu a mers bine...

source: removed from favourites
ro: eliminat din favorite

source: My ads
ro: Anunturile mele

source: Logout
ro: Deconectare

source: CREATE NEW AD
ro: ADAUGA UN ANUNT NOU

source: Wishlist
ro: Favorite

source: Language
ro: Limba

source: Product details
ro: Detaliile produsului

source: Posted at
ro: Postat la

source: Starting price
ro: Pret de pornire

source: Condition
ro: Stare

source: NEW
ro: Nou

source: USED
ro: Folosit

source: Press the button to bid the entered amount
ro: Apasati butonul pentru a licita suma introdusa

source: BID
ro: LICITEAZA

source: Who is interested?
ro: Cine este interesat?

source: About this item...
ro: Despre acest produs...

source: Edit
ro: Editeaza

source: Delete
ro: Sterge

source: Time left
ro: Timp ramas

source: Days
ro: Zile

source: Hours
ro: Ore

source: Minutes
ro: Minute

source: Seconds
ro: Secunde

source: Seller
ro: Vanzator

source: Member since:
ro: Membru din:

source: Location
ro: Localizare

source: Please choose a value greater than the last bid and starting price. The entered amount will be in
ro: Va rugam sa alegeti o valoare mai mare decat ultima oferta si pretul initial. Suma introdusa va fi in

source: Bidding finished!
ro: Licitatie finalizata!

source: Edit Product
ro: Editeaza Produsul

source: Edit product
ro: Editeaza Produsul

source: Please set the product's starting price
ro: Va rugam sa setati pretul de pornire al licitatiei

source: Images
ro: Imagini

source: Please choose some images which describe your product
ro: Va rugam sa alegeti cateva imagini reprezentative pentru produsul vandut

source: The first image will be the main image of your product
ro: Prima imagine va reprezenta imaginea principala a anuntului

source: We recommend using horizontal/landscape images
ro: Va recomandam sa folositi imagini orizontale/tip peisaj

source: Auction details
ro: Detalii despre licitatie

source: Please choose an ending date and time for the bidding
ro: Va rugam sa alegeti data si ora incheierii licitatiei

source: End hour
ro: Ora incheierii

source: Contact details
ro: Detalii de contact

source: Enter your city or postal code...
ro: Introduceti orasul sau codul postal

source: New Product
ro: Anunt nou

source: The Product
ro: Produsul

source: Upload
ro: Incarca

source: New product
ro: Adauga un anunt nou

source: New
ro: Nou

source: Used
ro: Folosit

source: There are no ads available at the moment...
ro: Nu exista anunturi disponibile in acest moment ...

source: There are no products matching your search...
ro: Nu exista produse care se potrivesc cautarii dvs...

source: Available products
ro: Anunturi disponibile

source: Home
ro: Acasa

source: Add to favourite
ro: Adauga la favorite

source: January
ro: Ianuarie

source: February
ro: Februarie

source: April
ro: Aprilie

source: May
ro: Mai

source: June
ro: Iunie

source: July
ro: Iulie

source: September
ro: Septembrie

source: October
ro: Octombrie

source: November
ro: Noiembrie

source: December
ro: Decembrie

source: at
ro: la

source: Password reset for user
ro: Resetare parola pentru utlizatorul

source: Welcome to Bidder!
ro: Bine ati venit pe site-ul Bidder!

source: English
ro: Engleza

source: Kind Regards,
ro: O zi frumoasa,

source: Thanks for using our site!
ro: Va multumim pentru utilizarea site-ului nostru!

source: Request a new activation link
ro: Cere un nou link de activare

source: Account with this Email already exists.
ro: Exista deja un cont asociat acestui email.
