Repository: DariusFeher/Bidder
Catalog: products/locale/*/LC_MESSAGES/django.po
Languages: ro

source: EUR (€)
ro: EURO (€)

source: GBP (£)
ro: LIRE (£)

source: New
ro: Nou

source: Used
ro: Folosit

source: Title
ro: Titlu

source: Please set a suggestive title for your product which contains at least 5 characters
ro: Va rugam sa setati un titlu sugestiv pentru produsul dumneavostra, care contine cel putin 5 caractere

source: Please describe the product you are selling
ro: Va rugam descrieti produsul pe care il vindeti

source: Description
ro: Descriere

source: Condition
ro: Stare

source: Starting price
ro: Pret de pornire al licitatiei

source: Please set the product's starting price
ro: Va rugam sa setati pretul de pornire al licitatiei

source: Please choose an ending date and time for the bidding
ro: Va rugam sa alegeti data si ora incheierii licitatiei

source: End hour
ro: Ora incheierii

source: Main image
ro: Imagine principala

source: Please set a main image for your product
ro: Va rugam sa alegeti o imagine principala a anuntului

source: Image 2
ro: Imagine 2

source: Image 3
ro: Imagine 3

source: Image 4
ro: Imagine 4

source: Image 5
ro: Imagine 5

source: Image 6
ro: Imagine 6

source: Currency
ro: Moneda

source: Phone number
ro: Numar de telefon

source: Please enter a phone number (e.g. +40792011221).
ro: Va rugam sa introduceti un numar de telefon (de exemplu: +40792011221).

source: Enter a valid phone number (e.g. +40792011221).
ro: Introduceti un numar de telefon valid (de exemplu: +40792011221).

source: The title should contain at least 5 characters.
ro: Titlul trebuie sa contina cel putin 5 caractere.

source: The description should contain at least 5 characters.
ro: Descrierea trebuie sa contina cel putin 5 caractere

source: The starting price should be greater than or equal to 0.
ro: Pretul de pornire trebuie sa fie mai mare sau egal cu 0.

source: The date and time cannot be in the past.
ro: Data si ora nu pot fi in trecut.

source: Choose condition...
ro: Alege starea produsului...

source: Choose seller...
ro: Alege vanzatorul...

source: Search term...
ro: Anuntul cautat...

source: Seller
ro: Vanzator

source: Starting price should be less than...
ro: Pretul de pornire trebuie sa fie mai mic decat...

source: The auction should end no later than...
ro: Licitatia ar trebui sa se incheie cel tarziu...

source: Choose the city, e.g. Bucuresti, Romania
ro: Alege orasul, e.x. Bucuresti, Romania

source: at
ro: la

source: , your bidding is the highest one at the moment!
ro: , oferta dumneavoastra este cea mai mare în acest moment!

source: Outbid! You need to raise your bid for
ro: Cineva a licitat mai mult decat dumneavoastra!Trebuie sa va măriți suma licitata pentru

source: Something went wrong...
ro: A aparut o eroare...

source: Product
ro: Produsul

source: deleted successfully
ro: a fost sters cu succes.

source: Your bid has been recorded.
ro: Oferta dumneavoastra a fost inregistrata.

source: Auction has finished!
ro: Licitatia s-a finalizat!

source: You currently have no ads...
ro: Momentan nu ai niciun anunt...

source: There are no products matching your search...
ro: Nu sunt produse care se potrivesc căutării dvs...

source: Your products
ro: Produsele tale

source: You currently have no favourite ads...
ro: Momentan nu ai niciun anunt favorit...

source: Wishlist products
ro: Produse preferate
