Repository: DariusFeher/Bidder
Catalog: users/locale/*/LC_MESSAGES/django.po
Languages: ro

source: Username
ro: Nume de utilizator

source: Password
ro: Parola

source: Re-enter Password
ro: Reintrodu parola

source: The username should contain at least 5 characters.
ro: Numele de utilizator trebuie sa contina cel putin 5 caractere.

source: Account with this Email already exists.
ro: Exista deja un cont asociat acestui email.

source: Username or Email
ro: Nume de utilizator sau Email

source: Please activate your account!
ro: , va rugam sa verificati email-ul si sa va activati contul!

source: Password reset for user
ro: Resetarea parolei pentru utilizatorul

source: , please verify your email and activate your account!
ro: , va rugam sa verificati email-ul si sa va activati contul!

source: Something went wrong...
ro: A aparut o eroare...

source: Email is not verified. Please verify your email. Email not received? Check spam or
ro: Email-ul nu e verificat. Va rugam sa verificati email-ul. Nu ati primit email-ul? Verificati folder-ul spam sau

source: Incorrect Username or Password!
ro: Nume de utilizator sau parola incorecta

source: You have successfully signed out!
ro: V-a»õi deconectat cu succes!

source: Email verified, you can now login!
ro: Email verificat cu succes, acum va puteti autentifica!

source: Email is already verified!
ro: Email-ul este deja verificat!

source: Something unexpected happened.
ro: A aparut o eroare.

source: You will receive a new activation link if there is an account associated with this email.
ro: Veti primi un nou link de activare in cazul in care exista un cont asociat email-ului introdus.

source: You will receive a link to reset your password if there is an account associated with this email.
ro: Veti primi un link de resetare a parolei in cazul in care exista un cont asociat email-ului introdus.

source: Password changed, you can now login!
ro: Parola schimbata cu succes, acum va puteti autentifica!

source: Something went wrong.
ro: A aparut o eroare.

source: Something unexpected happened.
ro: A aparut o eroare.
